In [1]:
import pandas as pd

In [19]:
names = {'Firstname': ['Shahbaz','Omer','Ali','Rafe'],'lastname':['Syed','Mohd','Abdul','Khan']}

In [22]:
df = pd.DataFrame(names,columns=['Firstname','lastname'])

In [23]:
df

  Firstname lastname
0   Shahbaz     Syed
1      Omer     Mohd
2       Ali    Abdul
3      Rafe     Khan

In [24]:
name =  {'Firstname': ['Shahbaz','Omer','Ali','Rafe']}

In [26]:
df2 = pd.DataFrame(name,columns=['Firstname'])

In [27]:
df2

  Firstname
0   Shahbaz
1      Omer
2       Ali
3      Rafe

In [28]:
type(df2)

pandas.core.frame.DataFrame

In [30]:
type(df2.Firstname)

pandas.core.series.Series

In [31]:
tips = pd.read_csv('https://raw.github.com/pandas-dev/pandas/master/pandas/tests/data/tips.csv')

In [32]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [33]:
tips.to_csv('mytips.csv')

In [34]:
!ls mytip*

mytips.csv

In [35]:
mytips = pd.read_csv('mytips.csv')

In [36]:
mytips.head()

   Unnamed: 0  total_bill   tip     sex smoker  day    time  size
0           0       16.99  1.01  Female     No  Sun  Dinner     2
1           1       10.34  1.66    Male     No  Sun  Dinner     3
2           2       21.01  3.50    Male     No  Sun  Dinner     3
3           3       23.68  3.31    Male     No  Sun  Dinner     2
4           4       24.59  3.61  Female     No  Sun  Dinner     4

In [38]:
tips['time'].unique()

array(['Dinner', 'Lunch'], dtype=object)

In [39]:
disc = tips['total_bill']*1.1

In [40]:
disc

0      18.689
1      11.374
2      23.111
3      26.048
4      27.049
5      27.819
6       9.647
7      29.568
8      16.544
9      16.258
10     11.297
11     38.786
12     16.962
13     20.273
14     16.313
15     23.738
16     11.363
17     17.919
18     18.667
19     22.715
20     19.712
21     22.319
22     17.347
23     43.362
24     21.802
25     19.591
26     14.707
27     13.959
28     23.870
29     21.615
        ...
214    30.987
215    14.190
216    30.965
217    12.749
218     8.514
219    33.154
220    13.376
221    14.762
222     9.438
223    17.578
224    14.762
225    17.897
226    11.099
227    22.495
228    14.608
229    24.332
230    26.411
231    17.259
232    12.771
233    11.847
234    17.083
235    11.077
236    13.860
237    36.113
238    39.413
239    31.933
240    29.898
241    24.937
242    19.602
243    20.658
Name: total_bill, Length: 244, dtype: float64

In [41]:
tips['Discount'] = disc

In [42]:
tips.head()

   total_bill   tip     sex smoker  day    time  size  Discount
0       16.99  1.01  Female     No  Sun  Dinner     2    18.689
1       10.34  1.66    Male     No  Sun  Dinner     3    11.374
2       21.01  3.50    Male     No  Sun  Dinner     3    23.111
3       23.68  3.31    Male     No  Sun  Dinner     2    26.048
4       24.59  3.61  Female     No  Sun  Dinner     4    27.049

In [43]:
def disc_func(tot_bill):
    if tot_bill > 20:
        disc = 10
    else:
        disc = 5
    return disc

In [44]:
tips['total_bill'].apply(disc_func)

0       5
1       5
2      10
3      10
4      10
5      10
6       5
7      10
8       5
9       5
10      5
11     10
12      5
13      5
14      5
15     10
16      5
17      5
18      5
19     10
20      5
21     10
22      5
23     10
24      5
25      5
26      5
27      5
28     10
29      5
       ..
214    10
215     5
216    10
217     5
218     5
219    10
220     5
221     5
222     5
223     5
224     5
225     5
226     5
227    10
228     5
229    10
230    10
231     5
232     5
233     5
234     5
235     5
236     5
237    10
238    10
239    10
240    10
241    10
242     5
243     5
Name: total_bill, Length: 244, dtype: int64

In [5]:
tips['sex'].apply(lambda x: x.lower())

NameError: name 'tips' is not defined

In [4]:
tips

NameError: name 'tips' is not defined

In [52]:
tips.rename(columns={'sex':'gender'},inplace=True)

In [53]:
tips.head()

   total_bill   tip  gender smoker  day    time  size  Discount
0       16.99  1.01  Female     No  Sun  Dinner     2    18.689
1       10.34  1.66    Male     No  Sun  Dinner     3    11.374
2       21.01  3.50    Male     No  Sun  Dinner     3    23.111
3       23.68  3.31    Male     No  Sun  Dinner     2    26.048
4       24.59  3.61  Female     No  Sun  Dinner     4    27.049

In [54]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
total_bill    244 non-null float64
tip           244 non-null float64
gender        244 non-null object
smoker        244 non-null object
day           244 non-null object
time          244 non-null object
size          244 non-null int64
Discount      244 non-null float64
dtypes: float64(3), int64(1), object(4)
memory usage: 15.3+ KB

In [55]:
emp = pd.read_csv('employee.csv')

In [56]:
emp.head()

  employee id        fullname position  salary manager id  department id
0     ind-001    Abdul Rehman      CSO  100000        NaN              1
1     ind-002       M. Yousuf      CTO   90000    ind-001              1
2     ind-003  Joseph D'Souza      CVO   84000    ind-001              1
3     ind-004  Mahesh Kalmadi      CWO   70000    ind-002              2
4      us-001  Jogender Singh      STO   56000    ind-002              2

In [58]:
emp.columns = [c.replace(' ','_') for c in emp.columns]   # List compre

In [65]:
import numpy as np

In [66]:
emp['salary'].loc[0] = np.nan

/usr/local/lib/python3.5/dist-packages/pandas/core/indexing.py:189: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [67]:
emp.head()

  employee_id        fullname position   salary manager_id  department_id
0     ind-001    Abdul Rehman      CSO      NaN        NaN              1
1     ind-002       M. Yousuf      CTO  90000.0    ind-001              1
2     ind-003  Joseph D'Souza      CVO  84000.0    ind-001              1
3     ind-004  Mahesh Kalmadi      CWO  70000.0    ind-002              2
4      us-001  Jogender Singh      STO  56000.0    ind-002              2

In [68]:
avg = emp['salary'].mean()

In [69]:
avg

67666.66666666667

In [72]:
emp['salary'].replace(np.nan,avg,inplace=True)

In [73]:
emp.head()

  employee_id        fullname position        salary manager_id  department_id
0     ind-001    Abdul Rehman      CSO  67666.666667        NaN              1
1     ind-002       M. Yousuf      CTO  90000.000000    ind-001              1
2     ind-003  Joseph D'Souza      CVO  84000.000000    ind-001              1
3     ind-004  Mahesh Kalmadi      CWO  70000.000000    ind-002              2
4      us-001  Jogender Singh      STO  56000.000000    ind-002              2

In [77]:
salc = 0
for i,r in emp.iterrows():
    #print (i)
    #print ('\n')
    #print (r)
    if r.salary > 70000:
        salc+=1
print (salc)

2

In [79]:
emp.sort_values(by='salary',ascending=False)

  employee_id        fullname position        salary manager_id  department_id
1     ind-002       M. Yousuf      CTO  90000.000000    ind-001              1
2     ind-003  Joseph D'Souza      CVO  84000.000000    ind-001              1
3     ind-004  Mahesh Kalmadi      CWO  70000.000000    ind-002              2
0     ind-001    Abdul Rehman      CSO  67666.666667        NaN              1
4      us-001  Jogender Singh      STO  56000.000000    ind-002              2
5      us-002     Syed Mannan      SPO  56000.000000    ind-003              3
6     dub-001            John      CTO  50000.000000    ind-002              0

In [6]:
tips = pd.read_csv('https://raw.github.com/pandas-dev/pandas/master/pandas/tests/data/tips.csv')

NameError: name 'pd' is not defined

In [7]:
import pandas as pd